#pragma once
#include"基本定义/属性范式.hpp"

命名空间 万国码空间 {
    三体(类 元素);
    模板<类 元素> 结构体 数据{
        文字 值;
        数据(文字 值 = u'\0') :
            值(值) {
        }
    };

    模板<类 元素> 结构体 接口{
        卡诺匹斯(元素);
        静态 常量 自然数 全角半角距离 = (u'ａ' - u'a');
        静态 常量 自然数 小写大写距离 = (u'a' - u'A');
        布尔 介于(文字 左闭区间, 文字 右闭区间) 常量 {
            回递 左闭区间 <= $O && $O <= 右闭区间;
        }
        公有只读(自然数, 宽度) {
            回递 $D.值 > 0xff ? 2 : 1;
        }
        公有只读(文字, 小写格式){
            回递 是大写字母 ? $O + 小写大写距离 : $O;
        }
        公有只读(文字, 大写格式) {
            回递 是小写字母 ? $O - 小写大写距离 : $O;
        }
        公有只读(文字, 半角小写格式) {
            若 (是半角大写字母) {
                回递 $O + 小写大写距离;
            }
            若 (是全角小写字母){
                回递 $O - 全角半角距离;
            }
            若 (是全角大写字母) {
                回递 $O - 全角半角距离 + 小写大写距离;
            }
            非{
                回递 $O;
            }
        }
        公有只读(文字, 半角大写格式) {
            若 (是半角小写字母) {
                回递 $O - 小写大写距离;
            }
            若 (是全角大写字母){
                回递 $O - 全角半角距离;
            }
            若 (是全角小写字母) {
                回递 $O - 全角半角距离 - 小写大写距离;
            }
            非{
                回递 $O;
            }
        }
        公有只读(文字, 全角小写格式) {
            若 (是半角大写字母) {
                回递 $O + 全角半角距离 + 小写大写距离;
            }
            若 (是半角小写字母) {
                回递 $O + 全角半角距离;
            }
            若 (是全角大写字母) {
                回递 $O + 小写大写距离;
            }
            非{
                回递 $O;
            }
        }
        公有只读(文字, 全角大写格式){ 
            若 (是半角小写字母) {
                回递 $O + 全角半角距离 - 小写大写距离;
            }
            若 (是半角大写字母) {
                回递 $O + 全角半角距离;
            }
            若 (是全角小写字母) {
                回递 $O - 小写大写距离;
            }
            非{
                回递 $O;
            }
        }
        公有只读(布尔, 是半角小写字母) {
            回递 介于(u'a', u'z');
        }
        公有只读(布尔, 是半角大写字母) {
            回递 介于(u'A', u'Z');
        }
        公有只读(布尔, 是半角数字) {
            回递 介于(u'0', u'9');
        }
        公有只读(布尔, 是半角小写十六进制数字) {
            回递 介于(u'a', u'f') || 是半角数字;
        }
        公有只读(布尔, 是半角大写十六进制数字) {
            回递 介于(u'A', u'F') || 是半角数字;
        }
        公有只读(布尔, 是半角十六进制数字) {
            回递 介于(u'A', u'F') || 介于(u'a', u'f') || 是半角数字;
        }
        公有只读(布尔, 是全角小写字母) {
            回递 介于(u'ａ', u'ｚ');
        }
        公有只读(布尔, 是全角大写字母) {
            回递 介于(u'Ａ', u'Ｚ');
        }
        公有只读(布尔, 是全角数字) {
            回递 介于(u'０', u'９');
        }
        公有只读(布尔, 是全角小写十六进制数字) {
            回递 介于(u'ａ', u'ｆ') || 是全角数字;
        }
        公有只读(布尔, 是全角大写十六进制数字) {
            回递 介于(u'Ａ', u'ｆ') || 是全角数字;
        }
        公有只读(布尔, 是全角十六进制数字) {
            回递 介于(u'Ａ', u'ｆ') || 介于(u'ａ', u'ｆ') || 是全角数字;
        }

        公有只读(布尔, 是字母) {
            回递 是小写字母 || 是大写字母;
        }
        公有只读(布尔, 是空白字符) {
            回递
                $D.值 == 文字(0x9   ) ||
                $D.值 == 文字(0xa   ) ||
                $D.值 == 文字(0xb   ) ||
                $D.值 == 文字(0xc   ) ||
                $D.值 == 文字(0xd   ) ||
                $D.值 == 文字(0x20  ) ||
                $D.值 == 文字(0x85  ) ||
                $D.值 == 文字(0xa0  ) ||
                $D.值 == 文字(0x1680) ||
                $D.值 == 文字(0x2000) ||
                $D.值 == 文字(0x2001) ||
                $D.值 == 文字(0x2002) ||
                $D.值 == 文字(0x2003) ||
                $D.值 == 文字(0x2004) ||
                $D.值 == 文字(0x2005) ||
                $D.值 == 文字(0x2006) ||
                $D.值 == 文字(0x2007) ||
                $D.值 == 文字(0x2008) ||
                $D.值 == 文字(0x2009) ||
                $D.值 == 文字(0x200a) ||
                $D.值 == 文字(0x2028) ||
                $D.值 == 文字(0x2029) ||
                $D.值 == 文字(0x202f) ||
                $D.值 == 文字(0x205f) ||
                $D.值 == 文字(0x3000);
        }

        公有只读(布尔, 是小写字母) {
            回递 是半角小写字母 || 是全角小写字母;
        }
        公有只读(布尔, 是大写字母) {
            回递 是半角大写字母 || 是全角大写字母;
        }
        公有只读(布尔, 是数字) {
            回递 是半角数字 || 是全角数字;
        }
        公有只读(布尔, 是小写十六进制数字) {
            回递 是半角小写十六进制数字 || 是全角小写十六进制数字;
        }
        公有只读(布尔, 是大写十六进制数字) {
            回递 是半角大写十六进制数字 || 是全角大写十六进制数字;
        }
        公有只读(布尔, 是十六进制数字) {
            回递 是半角十六进制数字 || 是全角十六进制数字;
        }
        公有只读(布尔, 是C0控制符及基本拉丁文) {
            回递 介于(0x0000, 0x007F);
        }
        公有只读(布尔, 是C1控制符及拉丁文补充) {
            回递 介于(0x0080, 0x00FF);
        }
        公有只读(布尔, 是拉丁文扩展甲) {
            回递 介于(0x0100, 0x017F);
        }
        公有只读(布尔, 是拉丁文扩展乙) {
            回递 介于(0x0180, 0x024F);
        }
        公有只读(布尔, 是国际音标扩展) {
            回递 介于(0x0250, 0x02AF);
        }
        公有只读(布尔, 是空白修饰字母) {
            回递 介于(0x02B0, 0x02FF);
        }
        公有只读(布尔, 是结合用读音符号) {
            回递 介于(0x0300, 0x036F);
        }
        公有只读(布尔, 是希腊文及科普特文) {
            回递 介于(0x0370, 0x03FF);
        }
        公有只读(布尔, 是西里尔字母) {
            回递 介于(0x0400, 0x04FF);
        }
        公有只读(布尔, 是西里尔字母补充) {
            回递 介于(0x0500, 0x052F);
        }
        公有只读(布尔, 是亚美尼亚语) {
            回递 介于(0x0530, 0x058F);
        }
        公有只读(布尔, 是希伯来文) {
            回递 介于(0x0590, 0x05FF);
        }
        公有只读(布尔, 是阿拉伯文) {
            回递 介于(0x0600, 0x06FF);
        }
        公有只读(布尔, 是叙利亚文) {
            回递 介于(0x0700, 0x074F);
        }
        公有只读(布尔, 是阿拉伯文补充) {
            回递 介于(0x0750, 0x077F);
        }
        公有只读(布尔, 是马尔代夫语) {
            回递 介于(0x0780, 0x07BF);
        }
        公有只读(布尔, 是西非书面语言) {
            回递 介于(0x07C0, 0x077F);
        }
        公有只读(布尔, 是阿维斯塔语及巴列维语) {
            回递 介于(0x0800, 0x085F);
        }
        公有只读(布尔, 是Mandaic) {
            回递 介于(0x0860, 0x087F);
        }
        公有只读(布尔, 是撒马利亚语) {
            回递 介于(0x0880, 0x08AF);
        }
        公有只读(布尔, 是天城文书) {
            回递 介于(0x0900, 0x097F);
        }
        公有只读(布尔, 是孟加拉语) {
            回递 介于(0x0980, 0x09FF);
        }
        公有只读(布尔, 是锡克教文) {
            回递 介于(0x0A00, 0x0A7F);
        }
        公有只读(布尔, 是古吉拉特文) {
            回递 介于(0x0A80, 0x0AFF);
        }
        公有只读(布尔, 是奥里亚文) {
            回递 介于(0x0B00, 0x0B7F);
        }
        公有只读(布尔, 是泰米尔文) {
            回递 介于(0x0B80, 0x0BFF);
        }
        公有只读(布尔, 是泰卢固文) {
            回递 介于(0x0C00, 0x0C7F);
        }
        公有只读(布尔, 是卡纳达文) {
            回递 介于(0x0C80, 0x0CFF);
        }
        公有只读(布尔, 是德拉维族语) {
            回递 介于(0x0D00, 0x0D7F);
        }
        公有只读(布尔, 是僧伽罗语) {
            回递 介于(0x0D80, 0x0DFF);
        }
        公有只读(布尔, 是泰文) {
            回递 介于(0x0E00, 0x0E7F);
        }
        公有只读(布尔, 是老挝文) {
            回递 介于(0x0E80, 0x0EFF);
        }
        公有只读(布尔, 是藏文) {
            回递 介于(0x0F00, 0x0FFF);
        }
        公有只读(布尔, 是缅甸语) {
            回递 介于(0x1000, 0x109F);
        }
        公有只读(布尔, 是格鲁吉亚语) {
            回递 介于(0x10A0, 0x10FF);
        }
        公有只读(布尔, 是朝鲜文) {
            回递 介于(0x1100, 0x11FF);
        }
        公有只读(布尔, 是埃塞俄比亚语) {
            回递 介于(0x1200, 0x137F);
        }
        公有只读(布尔, 是埃塞俄比亚语补充) {
            回递 介于(0x1380, 0x139F);
        }
        公有只读(布尔, 是切罗基语) {
            回递 介于(0x13A0, 0x13FF);
        }
        公有只读(布尔, 是统一加拿大土著语音节) {
            回递 介于(0x1400, 0x167F);
        }
        公有只读(布尔, 是欧甘字母) {
            回递 介于(0x1680, 0x169F);
        }
        公有只读(布尔, 是如尼文) {
            回递 介于(0x16A0, 0x16FF);
        }
        公有只读(布尔, 是塔加拉语) {
            回递 介于(0x1700, 0x171F);
        }
        公有只读(布尔, 是哈努诺文) {
            回递 介于(0x1720, 0x173F);
        }
        公有只读(布尔, 是布迪文) {
            回递 介于(0x1740, 0x175F);
        }
        公有只读(布尔, 是塔格巴努亚文) {
            回递 介于(0x1760, 0x177F);
        }
        公有只读(布尔, 是高棉语) {
            回递 介于(0x1780, 0x17FF);
        }
        公有只读(布尔, 是蒙古文) {
            回递 介于(0x1800, 0x18AF);
        }
        公有只读(布尔, 是Cham) {
            回递 介于(0x18B0, 0x18FF);
        }
        公有只读(布尔, 是林布文) {
            回递 介于(0x1900, 0x194F);
        }
        公有只读(布尔, 是德宏泰语) {
            回递 介于(0x1950, 0x197F);
        }
        公有只读(布尔, 是新傣仂语) {
            回递 介于(0x1980, 0x19DF);
        }
        公有只读(布尔, 是高棉语记号) {
            回递 介于(0x19E0, 0x19FF);
        }
        公有只读(布尔, 是布吉文) {
            回递 介于(0x1A00, 0x1A1F);
        }
        公有只读(布尔, 是巴塔克文) {
            回递 介于(0x1A20, 0x1A5F);
        }
        公有只读(布尔, 是兰纳文) {
            回递 介于(0x1A80, 0x1AEF);
        }
        公有只读(布尔, 是巴厘语) {
            回递 介于(0x1B00, 0x1B7F);
        }
        公有只读(布尔, 是巽他语) {
            回递 介于(0x1B80, 0x1BB0);
        }
        公有只读(布尔, 是杨松录苗文) {
            回递 介于(0x1BC0, 0x1BFF);
        }
        公有只读(布尔, 是雷布查语) {
            回递 介于(0x1C00, 0x1C4F);
        }
        公有只读(布尔, 是OlChiki) {
            回递 介于(0x1C50, 0x1C7F);
        }
        公有只读(布尔, 是曼尼普尔语) {
            回递 介于(0x1C80, 0x1CDF);
        }
        公有只读(布尔, 是语音学扩展) {
            回递 介于(0x1D00, 0x1D7F);
        }
        公有只读(布尔, 是语音学扩展补充) {
            回递 介于(0x1D80, 0x1DBF);
        }
        公有只读(布尔, 是结合用读音符号补充) {
            回递 介于(0x1DC0, 0x1DFF);
        }
        公有只读(布尔, 是拉丁文扩充附加) {
            回递 介于(0x1E00, 0x1EFF);
        }
        公有只读(布尔, 是希腊语扩充) {
            回递 介于(0x1F00, 0x1FFF);
        }
        公有只读(布尔, 是常用标点) {
            回递 介于(0x2000, 0x206F);
        }
        公有只读(布尔, 是上标及下标) {
            回递 介于(0x2070, 0x209F);
        }
        公有只读(布尔, 是货币符号) {
            回递 介于(0x20A0, 0x20CF);
        }
        公有只读(布尔, 是组合用记号) {
            回递 介于(0x20D0, 0x20FF);
        }
        公有只读(布尔, 是字母式符号) {
            回递 介于(0x2100, 0x214F);
        }
        公有只读(布尔, 是数字形式) {
            回递 介于(0x2150, 0x218F);
        }
        公有只读(布尔, 是箭头) {
            回递 介于(0x2190, 0x21FF);
        }
        公有只读(布尔, 是数学运算符) {
            回递 介于(0x2200, 0x22FF);
        }
        公有只读(布尔, 是杂项工业符号) {
            回递 介于(0x2300, 0x23FF);
        }
        公有只读(布尔, 是控制图片) {
            回递 介于(0x2400, 0x243F);
        }
        公有只读(布尔, 是光学识别符) {
            回递 介于(0x2440, 0x245F);
        }
        公有只读(布尔, 是封闭式字母数字) {
            回递 介于(0x2460, 0x24FF);
        }
        公有只读(布尔, 是制表符) {
            回递 介于(0x2500, 0x257F);
        }
        公有只读(布尔, 是方块元素) {
            回递 介于(0x2580, 0x259F);
        }
        公有只读(布尔, 是几何图形) {
            回递 介于(0x25A0, 0x25FF);
        }
        公有只读(布尔, 是杂项符号) {
            回递 介于(0x2600, 0x26FF);
        }
        公有只读(布尔, 是印刷符号) {
            回递 介于(0x2700, 0x27BF);
        }
        公有只读(布尔, 是杂项数学符号甲) {
            回递 介于(0x27C0, 0x27EF);
        }
        公有只读(布尔, 是追加箭头甲) {
            回递 介于(0x27F0, 0x27FF);
        }
        公有只读(布尔, 是盲文点字模型) {
            回递 介于(0x2800, 0x28FF);
        }
        公有只读(布尔, 是追加箭头乙) {
            回递 介于(0x2900, 0x297F);
        }
        公有只读(布尔, 是杂项数学符号乙) {
            回递 介于(0x2980, 0x29FF);
        }
        公有只读(布尔, 是追加数学运算符) {
            回递 介于(0x2A00, 0x2AFF);
        }
        公有只读(布尔, 是杂项符号和箭头) {
            回递 介于(0x2B00, 0x2BFF);
        }
        公有只读(布尔, 是格拉哥里字母) {
            回递 介于(0x2C00, 0x2C5F);
        }
        公有只读(布尔, 是拉丁文扩展丙) {
            回递 介于(0x2C60, 0x2C7F);
        }
        公有只读(布尔, 是古埃及语) {
            回递 介于(0x2C80, 0x2CFF);
        }
        公有只读(布尔, 是格鲁吉亚语补充) {
            回递 介于(0x2D00, 0x2D2F);
        }
        公有只读(布尔, 是提非纳文) {
            回递 介于(0x2D30, 0x2D7F);
        }
        公有只读(布尔, 是埃塞俄比亚语扩展) {
            回递 介于(0x2D80, 0x2DDF);
        }
        公有只读(布尔, 是追加标点) {
            回递 介于(0x2E00, 0x2E7F);
        }
        公有只读(布尔, 是部首补充) {
            回递 介于(0x2E80, 0x2EFF);
        }
        公有只读(布尔, 是康熙字典部首) {
            回递 介于(0x2F00, 0x2FDF);
        }
        公有只读(布尔, 是表意文字描述符) {
            回递 介于(0x2FF0, 0x2FFF);
        }
        公有只读(布尔, 是表意文字符号和标点) {
            回递 介于(0x3000, 0x303F);
        }
        公有只读(布尔, 是日文平假名) {
            回递 介于(0x3040, 0x309F);
        }
        公有只读(布尔, 是日文片假名) {
            回递 介于(0x30A0, 0x30FF);
        }
        公有只读(布尔, 是注音字母) {
            回递 介于(0x3100, 0x312F);
        }
        公有只读(布尔, 是朝鲜文兼容字母) {
            回递 介于(0x3130, 0x318F);
        }
        公有只读(布尔, 是象形字注释标志) {
            回递 介于(0x3190, 0x319F);
        }
        公有只读(布尔, 是注音字母扩展) {
            回递 介于(0x31A0, 0x31BF);
        }
        公有只读(布尔, 是表意文字笔画) {
            回递 介于(0x31C0, 0x31EF);
        }
        公有只读(布尔, 是日文片假名语音扩展) {
            回递 介于(0x31F0, 0x31FF);
        }
        公有只读(布尔, 是封闭式) {
            回递 介于(0x3200, 0x32FF);
        }
        公有只读(布尔, 是表意文字兼容) {
            回递 介于(0x3300, 0x33FF);
        }
        公有只读(布尔, 是表意文字扩展甲) {
            回递 介于(0x3400, 0x4DBF);
        }
        公有只读(布尔, 是易经六十四卦符号) {
            回递 介于(0x4DC0, 0x4DFF);
        }
        公有只读(布尔, 是中文) {
            回递 介于(0x4E00, 0x9FBF);
        }
        公有只读(布尔, 是彝文音节) {
            回递 介于(0xA000, 0xA48F);
        }
        公有只读(布尔, 是彝文字根) {
            回递 介于(0xA490, 0xA4CF);
        }
        公有只读(布尔, 是瓦伊语) {
            回递 介于(0xA500, 0xA61F);
        }
        公有只读(布尔, 是统一加拿大土著语音节补充) {
            回递 介于(0xA660, 0xA6FF);
        }
        公有只读(布尔, 是声调修饰字母) {
            回递 介于(0xA700, 0xA71F);
        }
        公有只读(布尔, 是拉丁文扩展丁) {
            回递 介于(0xA720, 0xA7FF);
        }
        公有只读(布尔, 是Syloti) {
            回递 介于(0xA800, 0xA82F);
        }
        公有只读(布尔, 是八思巴字) {
            回递 介于(0xA840, 0xA87F);
        }
        公有只读(布尔, 是Saurashtra) {
            回递 介于(0xA880, 0xA8DF);
        }
        公有只读(布尔, 是爪哇语) {
            回递 介于(0xA900, 0xA97F);
        }
        公有只读(布尔, 是Chakma) {
            回递 介于(0xA980, 0xA9DF);
        }
        公有只读(布尔, 是Varang) {
            回递 介于(0xAA00, 0xAA3F);
        }
        公有只读(布尔, 是Sorang) {
            回递 介于(0xAA40, 0xAA6F);
        }
        公有只读(布尔, 是Newari) {
            回递 介于(0xAA80, 0xAADF);
        }
        公有只读(布尔, 是越南傣语) {
            回递 介于(0xAB00, 0xAB5F);
        }
        公有只读(布尔, 是Kayah) {
            回递 介于(0xAB80, 0xABA0);
        }
        公有只读(布尔, 是朝鲜文音节) {
            回递 介于(0xAC00, 0xD7AF);
        }
        公有只读(布尔, 是高位替代) {
            回递 介于(0xD800, 0xDBFF);
        }
        公有只读(布尔, 是低位替代) {
            回递 介于(0xDC00, 0xDFFF);
        }
        公有只读(布尔, 是自行使用区域) {
            回递 介于(0xE000, 0xF8FF);
        }
        公有只读(布尔, 是中日韩兼容象形文字) {
            回递 介于(0xF900, 0xFAFF);
        }
        公有只读(布尔, 是字母表达形式) {
            回递 介于(0xFB00, 0xFB4F);
        }
        公有只读(布尔, 是阿拉伯表达形式甲) {
            回递 介于(0xFB50, 0xFDFF);
        }
        公有只读(布尔, 是变量选择符) {
            回递 介于(0xFE00, 0xFE0F);
        }
        公有只读(布尔, 是竖排形式) {
            回递 介于(0xFE10, 0xFE1F);
        }
        公有只读(布尔, 是组合用半符号) {
            回递 介于(0xFE20, 0xFE2F);
        }
        公有只读(布尔, 是中日韩兼容形式) {
            回递 介于(0xFE30, 0xFE4F);
        }
        公有只读(布尔, 是小型变体形式) {
            回递 介于(0xFE50, 0xFE6F);
        }
        公有只读(布尔, 是阿拉伯表达形式乙) {
            回递 介于(0xFE70, 0xFEFF);
        }
        公有只读(布尔, 是半型及全型形式) {
            回递 介于(0xFF00, 0xFFEF);
        }
    };

    模板<类 元素> 结构体 运算{
        运算型卡诺匹斯(元素);
    公有
        运算重载 文字 &() {
            回递 $D.值;
        }
        空 运算重载 = (文字 值) {
            $D.值 = 值;
        }
    };
}

结构体 万国码 : 万国码空间::运算<哑元结构>{
    模板<类 类型>
    万国码(类型 常量 & 值): 
        数据((类型 &)值){
    }
    万国码(文字 值 = u'\0'):
        数据(值){
    }
私有
    万国码空间::数据<哑元结构> 数据;
};
