#include"数学/随机数.h"
#include"输入输出/控制台.h"
I32 重复1BIT[32];
I32 重复8BIT[256];
I32 正反频数[2];
I32 重复;

主函数() {
    随机数 变数;
    布尔   值 = 变数;
    U16    位组 = 1;
    循环(U32 I = 0; I < 1000 * 1000 * 1000; I++) {
        非寄 布尔 临时 = 变数;
        位组 = 位组 << 1 | 临时;
        正反频数[临时] += 1;

        若 (临时 == 值) {
            重复 += 1;
        }
        非{
            重复1BIT[重复]++;
            重复 = 0;
            值 = 临时;
        }
        若 (位组 & 0x100){
            重复8BIT[位组 & 0xff]++;
            位组 = 1;
        }
    }

    终端->打印一行(_"正反性能");
    终端->打印一行(正反频数[0]);
    终端->打印一行(正反频数[1]);
    终端->打印一行();
    终端->打印一行(_"1BIT几何分布性能");
    循环(U32 I = 0; I < 32; I++) {
        终端->打印一行(重复1BIT[I]);
    }
    终端->打印一行();
    终端->打印一行(_"8BIT几何分布性能");

    循环(U32 I = 0; I < 256; I++) {
        若 (I > 0 && (I & 0xf) == 0) {
            终端->打印一行();
        }
        终端->打印(重复8BIT[I]);
        终端->打印(_" ");
    }
    回递 0;
}
